select abs(-2388.23);                   -- 取绝对值
select mod(13,5);                       -- 取余数/求模
select random();                        -- 生成0~1之间的随机小数
select ceil(random() * 100);            -- 生成100以内的随机正整数

select ceil(12.34),                     -- 向上取整，进一法
       ceil(-12.34),                    -- 向上取整，进一法
       floor(12.34),                    -- 向下取整，舍一法
       floor(-12.34);                   -- 向下取整，舍一法

select round(98.7654321),               -- 四舍五入
       round(98.7654321, 2),            -- 四舍五入，精确两位小数
       round(98.7654321, 3),            -- 四舍五入，精确三位小数
       trunc(98.7654321),               -- 截断，取整
       trunc(98.7654321, 2),            -- 截断，精确两位小数
       trunc(98.7654321, 3);            -- 截断，精确三位小数